# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 3
b = 3.14
c = 'Hi'
d = True

print(type(a), type(b), type(c), type(d))
